Music_App/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        # @user = User.find_by_credentials(params[:users][:email], params[:users][:password])
        @user = User.find(params[:id])